#+TITLE: Manual de uso de =qbank=
#+AUTHOR: Marcos Bujosa
#+LANGUAGE: es
#+OPTIONS: toc:2 num:t
#+STARTUP: overview

# ─── Copyright ──────────────────────────────────────────────────────────────
# Copyright (C) 2020-2026  Andrés Bujosa, Marcos Bujosa (_quiz) / Marcos Bujosa (_export)
# GNU General Public License v3 or later — see <https://www.gnu.org/licenses/>

# ─── Configuración de org-babel ───────────────────────────────────
#+PROPERTY: header-args:python :python python3
#+PROPERTY: header-args:python :python /home/marcos/SynologyDrive/ReposGH/Docencia/qbank/.venv/bin/python3 :session *qbank*

# ─── LaTeX export ────────────────────────────────────────────────
#+LATEX_CLASS: report
#+LATEX_CLASS_OPTIONS: [10pt,a4paper]

#+LATEX_HEADER: \usepackage{fontspec}          % para fuentes Unicode
#+LATEX_HEADER: \usepackage{lmodern}           % o mejor, define una fuente explícita
#+LATEX_HEADER: \setmainfont{Latin Modern Roman} % o cualquier otra que quieras
#+LATEX_HEADER: \usepackage[spanish]{babel}
# +LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{tabularx} 
#+LATEX_HEADER: \usepackage{newunicodechar}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \newunicodechar{✓}{\checkmark}
#+LATEX_HEADER: \newunicodechar{✗}{$\times$}
#+LATEX_HEADER: \usepackage{etoolbox}
#+LATEX_HEADER: \AtBeginEnvironment{verbatim}{\small}

** =ProblemaTipo= — un generador de variantes

=ProblemaTipo= toma una lista de elementos y genera todas las combinaciones posibles,
produciendo una variante por cada combinación. Los elementos de la lista pueden ser:

- Cadenas de texto (texto fijo del enunciado).
- Un único =Supuesto= o =Cuestion= (aparece igual en todas las variantes).
- Una *lista* de =Supuesto= o =Cuestion= (en cada variante se elige uno de ellos).

#+begin_src python
ProblemaTipo(lista_de_elementos)
#+end_src

=ProblemaTipo= es un iterador: cada llamada a =next()= o cada iteración en un bucle
=for= devuelve una tupla =(etiqueta, enunciado, cuestiones)=:

| Campo        | Contenido                                                          |
|--------------+--------------------------------------------------------------------|
| =etiqueta=   | Número de variante como cadena (="1"=, ="2"=, …).                  |
| =enunciado=  | Texto completo del enunciado de esa variante.                      |
| =cuestiones= | Lista de tuplas =(texto, correcto, activa, explicacion)= por ítem. |

Ejemplo mínimo:

#+begin_src python :results output :exports both
from qbank import *

p = ProblemaTipo([
    "Dado que ",
    [
        Supuesto("$\\mathcal{A}$ es verdadero, ", v("A")),
        Supuesto("$\\mathcal{B}$ es verdadero, ", v("B")),
    ],
    "indique qué opción es correcta: ",
    [
        Cuestion("$\\mathcal{A}$ es verdadero.", v("A")),
        Cuestion("$\\mathcal{B}$ es verdadero.", v("B")),
    ],
])

for etiqueta, enunciado, cuestiones in p:
    print(f"Variante {etiqueta}:\n {enunciado}")
    for texto, correcto, activa, exp in cuestiones:
        marca = "✓" if correcto else "✗"
        print(f"  {texto} {marca}  ")
#+end_src

#+RESULTS:
: Variante 1: Dado que $\mathcal{A}$ es verdadero, indique qué opción es correcta: 
:   $\mathcal{A}$ es verdadero. ✓  
: Variante 2: Dado que $\mathcal{A}$ es verdadero, indique qué opción es correcta: 
:   $\mathcal{B}$ es verdadero. ✗  
: Variante 3: Dado que $\mathcal{B}$ es verdadero, indique qué opción es correcta: 
:   $\mathcal{A}$ es verdadero. ✗  
: Variante 4: Dado que $\mathcal{B}$ es verdadero, indique qué opción es correcta: 
:   $\mathcal{B}$ es verdadero. ✓

#+latex: \bigskip

Este ejemplo produce 4 variantes (2 supuestos × 2 cuestiones).

** =ProblemaVF= — preguntas de verdadero/falso

=ProblemaVF= sirve para un formato distinto: un banco de afirmaciones del que se
extraen aleatoriamente un subconjunto en cada variante. No usa cálculo proposicional;
la corrección de cada ítem se indica directamente con =True= o =False=.

#+begin_src python
ProblemaVF(enunciado, cuestiones, NumPreguntas)
#+end_src

| Parámetro      | Descripción                                                 |
|----------------+-------------------------------------------------------------|
| =enunciado=    | Texto del enunciado común a todas las variantes.            |
| =cuestiones=   | Lista de tuplas =(texto, correcto)=.                        |
| =NumPreguntas= | Cuántas afirmaciones se eligen aleatoriamente por variante. |

#+begin_src python :results output :exports both
enunciado = "Indique qué afirmaciones son verdaderas:"
banco = [
    ("Todo alumno que va a clase aprueba",   False),
    ("Todo alumno que sabe aprueba",         True),
    ("Si suspenden todos es frustrante",     True),
    ("Si aprueban todos eres buen profesor", False),
]
import random
random.seed(42) # para generar siempre el mismo ejemplo
GenVar = iter(ProblemaVF(enunciado, banco, 3))  # 3 ítems por variante

for _ in range(3):
      etiqueta, enunc, cuestiones = next(GenVar)
      print(f"\nVariante {etiqueta}:\n {enunc}  ")
      for texto, correcto in cuestiones:
          marca = "✓" if correcto else "✗"
          print(f"  {texto} {marca}") 

#+end_src

#+RESULTS:
#+begin_example

Variante 1:
 Indique qué afirmaciones son verdaderas:

  Todo alumno que va a clase aprueba ✗

  Si aprueban todos eres buen profesor ✗

  Todo alumno que sabe aprueba ✓


Variante 2:
 Indique qué afirmaciones son verdaderas:

  Todo alumno que sabe aprueba ✓

  Todo alumno que va a clase aprueba ✗

  Si suspenden todos es frustrante ✓


Variante 3:
 Indique qué afirmaciones son verdaderas:

  Todo alumno que va a clase aprueba ✗

  Si suspenden todos es frustrante ✓

  Si aprueban todos eres buen profesor ✗
#+end_example


** Ejemplo AMC básico

#+begin_src python
from qbank import *

p = ProblemaTipo([
    "Dado que ",
    [
        Supuesto("$\\mathcal{A}$ es verdadero. ", v("A")),
        Supuesto("$\\mathcal{B}$ es verdadero. ", v("B")),
    ],
    "indique qué opción es correcta: ",
    [
        Cuestion("$\\mathcal{A}$ es verdadero", v("A")),
        Cuestion("$\\mathcal{B}$ es verdadero", v("B")),
    ],
])

nombre = "MiCuestionario"
with open("preguntas.tex", "w") as f:
    for etiqueta, enunciado, cuestiones in p:
        f.write(AMC(nombre, etiqueta, enunciado, cuestiones))
#+end_src

#+begin_src python :results output :exports results
with open("preguntas.tex") as f:
    print(f.read())
  #+end_src

  #+RESULTS:
  #+begin_example
  \element{MiCuestionario}{
   \begin{questionmult}{MiCuestionario-1}
    Dado que $\mathcal{A}$ es verdadero. indique qué opción es correcta: 
       \begin{choices}
	 \correctchoice{$\mathcal{A}$ es verdadero}
       \end{choices}
   \end{questionmult} }

  \element{MiCuestionario}{
   \begin{questionmult}{MiCuestionario-2}
    Dado que $\mathcal{A}$ es verdadero. indique qué opción es correcta: 
       \begin{choices}
	 \wrongchoice  {$\mathcal{B}$ es verdadero}
       \end{choices}
   \end{questionmult} }

  \element{MiCuestionario}{
   \begin{questionmult}{MiCuestionario-3}
    Dado que $\mathcal{B}$ es verdadero. indique qué opción es correcta: 
       \begin{choices}
	 \wrongchoice  {$\mathcal{A}$ es verdadero}
       \end{choices}
   \end{questionmult} }

  \element{MiCuestionario}{
   \begin{questionmult}{MiCuestionario-4}
    Dado que $\mathcal{B}$ es verdadero. indique qué opción es correcta: 
       \begin{choices}
	 \correctchoice{$\mathcal{B}$ es verdadero}
       \end{choices}
   \end{questionmult} }
  #+end_example

